updatearchitecture diagram
